//  คำตอบที่ต้องการ
//  1) มีจำนวนนักเรียนทั้งหมดกี่คน
//  2) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย" และมีจำนวนนักเรียนเท่ากับกี่คน
//  3) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาง" และมีจำนวนนักเรียนเท่ากับกี่คน
//  4) แสดงชื่อนักเรียนทั้งหมด และแสดงเพศของนักเรียนแต่ละคน
//  5) แสดงลำดับของนักเรียนแต่ละคน
        // มีจำนวนนักเรียนเท่ากับกี่คน
        // มีจำนวนนักเรียนเพศชายเท่ากับกี่คน
        // มีจำนวนนักเรียนเพศหญิงเท่ากับกี่คน
//  6) แสดงรายการพัสดุ พร้อมทั้งบอกว่ามาจากไทยหรือต่างประเทศ
        // มีแสดงจำนวนพัสดุทั้งหมดเท่าไหร่
        // มีจำนวนพัสดุที่มาจากไทยเท่าไหร่
        // มีจำนวนพัสดุที่มาจากต่างประเทศเท่าไหร่

package W14;

public class W14_02_Array_Gender {
    public static void main(String[] args) {
              // สร้าง Array ชื่อ name เพื่อเก็บชื่อนักเรียน จำนวน 5 คน
        String [] name = {"นายสมชาย","นางสมใจ","นางสาวสมนึก","นายสมดี","นางสาวสมฤทัย"};
        String [] codes = {"123TH","124EN","125EN","126TH","127EN"};

        // 1) แสดงจำนวนนักเรียนทั้งหมด
        System.out.println("จำนวนทั้งหมด = "+name.length);

        System.out.println("====================================");
        



        // 2) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย" [startsWith()] และมีจำนวนนักเรียนเท่ากับกี่คน

        // แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย"
        // และมีจำนวนนักเรียนเท่ากับกี่คน
        System.out.println("ชื่อนักเรียนขึ้นต้นด้วยคำว่า 'นาย'");
        //System.out.println(name[0]);
        //System.out.println(name[3]);    //ทางลัดพวกขี้เกียจ
        int countAll = 0;
        for (int i=0; i<name.length;i++){
            if(name[i].startsWith("นาย")){
                System.out.println(name[i]);
                countAll++;
            }
        }
        System.out.println("จำนวนนักเรียนที่ขึ้นต้นด้วยคำว่า 'นาย' = "+countAll+" คน");
        
  
        System.out.println("====================================");
        




        //  3) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาง" 
        // และมีจำนวนนักเรียนเท่ากับกี่คน
        System.out.println("ชื่อนักเรียนขึ้นต้นด้วยคำว่า 'นาง'");
 
        countAll = 0;
        for (int i=0; i<name.length;i++){
            if(name[i].startsWith("นาง")){
                System.out.println(name[i]);
                countAll++;
            }
        }
        System.out.println("จำนวนนักเรียนที่ขึ้นต้นด้วยคำว่า 'นาง' = "+countAll+" คน");
    
        System.out.println("====================================");
        





        // 4) แสดงชื่อนักเรียนทั้งหมด และแสดงเพศของนักเรียนแต่ละคน
                // ถ้าชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย" ให้แสดงว่าเป็นเพศชาย
                // ถ้าชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาง" ให้แสดงว่าเป็นเพศหญิง
        countAll = 0;
        for (int i=0; i<name.length;i++){
            if(name[i].startsWith("นาย")){
                System.out.println(name[i]+" ชาย");
                countAll++;
            }else{
                System.out.println(name[i]+" หญิง");
                countAll++;
            }
        }

        // มีจำนวนนักเรียนเท่ากับกี่คน
        System.out.println("จำนวนนักเรียนทั้งหมด = "+countAll+" คน");

        System.out.println("====================================");
        // 5) แสดงเลขลำดับของนักเรียนแต่ละคน 
                // มีจำนวนนักเรียนเท่ากับกี่คน
                // มีจำนวนนักเรียนเพศชายเท่ากับกี่คน
                // มีจำนวนนักเรียนเพศหญิงเท่ากับกี่คน
        
        int countMale = 0;
        int countFemale = 0;
        countAll = countMale+countFemale;
        for(int i=0;i<name.length;i++){
            if(name[i].startsWith("นาย")){
                System.out.println((i+1+". ")+name[i]+" ชาย");
                countMale++;
            }else{
                System.out.println((i+1+". ")+name[i]+" หญิง");
                countFemale++;
            }
        }

        // มีจำนวนนักเรียนเท่ากับกี่คน
        System.out.println("จำนวนนักเรียนทั้งหมด "+countAll+" คน");

        // มีจำนวนนักเรียนเพศชายเท่ากับกี่คน
        System.out.println("จำนวนนักเรียน 'ชาย' = "+countMale+" คน");
        // มีจำนวนนักเรียนเพศหญิงเท่ากับกี่คน
        System.out.println("จำนวนนักเรียน 'หญิง' = "+" คน");

        System.out.println("====================================");
    }
}
