//  6) แสดงรายการพัสดุ พร้อมทั้งบอกว่ามาจากไทยหรือต่างประเทศ
        // มีแสดงจำนวนพัสดุทั้งหมดเท่าไหร่
        // มีจำนวนพัสดุที่มาจากไทยเท่าไหร่
        // มีจำนวนพัสดุที่มาจากต่างประเทศเท่าไหร่

        public class W14_Homework {
            public static void main(String[] args) {
                // สร้าง Array ชื่อ name เพื่อเก็บชื่อนักเรียน จำนวน 5 คน
                String [] name = {"นายสมชาย","นางสมใจ","นางสาวสมนึก","นายสมดี","นางสาวสมฤทัย"};
                String [] codes = {"123TH","124EN","125EN","126TH","127EN"};
        
                //  6) แสดงรายการพัสดุ พร้อมทั้งบอกว่ามาจากไทยหรือต่างประเทศ
                // มีแสดงจำนวนพัสดุทั้งหมดเท่าไหร่
                // มีจำนวนพัสดุที่มาจากไทยเท่าไหร่
                // มีจำนวนพัสดุที่มาจากต่างประเทศเท่าไหร่
                System.out.println("จำนวนสินค้าทั้งหมด : "+codes.length);

                int countTH = 0;
                int countEN = 0;

                for(int i=0;i<codes.length;i++){
                    if(codes[i].endsWith("TH")){
                        countTH++;
                    }else{
                        countEN++;
                    }
                }
                
                System.out.println("จำนวนสินค้าที่มาจากไทย : "+countTH);
                System.out.println("จำนวนสินค้าที่มาจากต่างประเทศ : "+countEN);

                System.out.println("====================================");
                
                
                
            }
        }
        
